<div style="background-color: #FFFFE0; padding: 10px; border: 1px solid #ddd;">
  <p style="color: #333333;"><b>Create DataFrame</b></p>

  <p style="color: #333333;">
  <ul style="color: #000000;">Dict</ul>
  <ul style="color: #000000;">List of Lists</ul>
  <ul style="color: #000000;">List of dicts</ul>
  <ul style="color: #000000;">Numpy array</ul>
  <ul style="color: #000000;">Dict with nested lists</ul>
  <ul style="color: #000000;">Pandas Series</ul>
  <ul style="color: #000000;">List of Tuples</ul>
  </p>
</div>

In [44]:
import pandas as pd
import numpy as np

In [45]:
# ⁡⁢⁣⁣1. Dict⁡

data = {
    'Name': ['John', 'Anna', 'Peter'],
    'Age': [28,24,35]
}
df = pd.DataFrame(data)
df.head()

    Name  Age
0   John   28
1   Anna   24
2  Peter   35

In [46]:
# 2. ⁡⁢⁣⁣List of lists⁡

data = [["John",28], ["Anna",24], ["Peter",35]]
df = pd.DataFrame(data, columns=['Name', 'Age'])
df.head()

    Name  Age
0   John   28
1   Anna   24
2  Peter   35

In [47]:
# 5. Pandas Series

series= pd.Series([1, 2, 3, 4, 5])
df = series.to_frame('Values')
df.head()

   Values
0       1
1       2
2       3
3       4
4       5

In [48]:
# 4. ⁡⁢⁣⁣Dict with Nested Lists⁡

data = {'Name': ['John', 'Anna', 'Peter'],
        'Scores': [[90, 80, 70], [85, 95, 75], [80, 75, 85]]}
df = pd.DataFrame(data)

df.head()

    Name        Scores
0   John  [90, 80, 70]
1   Anna  [85, 95, 75]
2  Peter  [80, 75, 85]

In [49]:
# 3. ⁡⁢⁣⁣Numpy Arrays⁡

data = np.array([[1,2,3], [4,5,6]])
df = pd.DataFrame(data, columns=['A', 'B', 'C'])
df.head()

   A  B  C
0  1  2  3
1  4  5  6

In [50]:
df.columns

Index(['A', 'B', 'C'], dtype='object')

In [51]:
pd.set_option(
    'display.max_rows',100
)
pd.set_option(
    'display.max_columns',10
)
pd.set_option(
    'display.float_format','{:.2f}'.format
)
pd.set_option(
    'display.max_rows',100
)
pd.set_option('display.width', 150)
pd.set_option('mode.use_inf_as_na', True)

/tmp/ipykernel_22166/1369880238.py:14: FutureWarning: use_inf_as_na option is deprecated and will be removed in a future version. Convert inf values to NaN before operating instead.
  pd.set_option('mode.use_inf_as_na', True)

In [52]:
data = {
    "Name": ["Nikhil","Sandeep","Potti"],
    "Age": [22,24,48],
    "Salary": [1200000,1200000,2400000]
}

df = pd.DataFrame(data)

df.head()

      Name  Age   Salary
0   Nikhil   22  1200000
1  Sandeep   24  1200000
2    Potti   48  2400000

# ACCESS

In [53]:
df['Name']

0     Nikhil
1    Sandeep
2      Potti
Name: Name, dtype: object

In [54]:
df[['Name','Salary']]

      Name   Salary
0   Nikhil  1200000
1  Sandeep  1200000
2    Potti  2400000

In [55]:
df.loc[:3:2] # rows range (start:end)

     Name  Age   Salary
0  Nikhil   22  1200000
2   Potti   48  2400000

In [56]:
df.iloc[0:3:2]

     Name  Age   Salary
0  Nikhil   22  1200000
2   Potti   48  2400000

In [57]:
df[df['Name'] == "Nikhil"][["Name","Age"]]

     Name  Age
0  Nikhil   22

In [58]:
print(df)

      Name  Age   Salary
0   Nikhil   22  1200000
1  Sandeep   24  1200000
2    Potti   48  2400000

<div style="background-color: #FFFFE0; padding: 10px; border: 1px solid #ddd;">
  <p style="color: #333333;"><b>Column & Row Operations</b></p>
</div>

In [59]:
# 1. ⁡⁣⁣⁢Add new column⁡

df['Role'] = ["AI Engineer", "Data Scientist", "MLOPS Developer"]
df['Company'] = ["C","C","C"]

# 2. Modify a column

df["Age"] = df["Age"] + 1

# 3. Delete a Column
df.drop(labels="Company", axis=1, inplace=True)

def func(row):
    row['Age'] = row['Age'] - 1
    return row

# 4. Apply the function to each row
df = df.apply(func, axis=1)

# 5. Rename a Column
df.rename(columns={'Name':'name'}, inplace=True)
df.rename(columns={'name':'Name'}, inplace=True)


# 6. Reset index after row operations
df.reset_index(drop=True, inplace=True) 

# 7. Set a column as index
df.set_index('Name', inplace=True)


# 8. Sort DataFrame by multiple columns
df.sort_values(by=['Age','Salary'], ascending=[True, False])


df.head()

         Age   Salary             Role
Name
Nikhil    22  1200000      AI Engineer
Sandeep   24  1200000   Data Scientist
Potti     48  2400000  MLOPS Developer

In [ ]:
import pandas as pd

# Create two sample DataFrames
df1 = pd.DataFrame({
    'A': ['A0', 'A1', 'A2', 'A3'],
    'B': ['B0', 'B1', 'B2', 'B3'],
    'C': ['C0', 'C1', 'C2', 'C3'],
    'D': ['D0', 'D1', 'D2', 'D3']
})

df2 = pd.DataFrame({
    'A': ['A0', 'A1', 'A4', 'A5'],
    'B': ['B0', 'B1', 'B4', 'B5'],
    'E': ['E0', 'E1', 'E4', 'E5'],
    'F': ['F0', 'F1', 'F4', 'F5']
})

# 1. Inner join two DataFrames on a column
print("Inner Join:")
print(df1.merge(df2, on='A', how='inner'))

# 2. Left join (retain all rows from the left DataFrame)
print("\nLeft Join:")
print(df1.merge(df2, on='A', how='left'))

# 3. Right join (retain all rows from the right DataFrame)
print("\nRight Join:")
print(df1.merge(df2, on='A', how='right'))

# 4. Outer join (retain all rows from both DataFrames)
print("\nOuter Join:")
print(df1.merge(df2, on='A', how='outer'))

# 5. Merge on multiple columns
print("\nMerge on Multiple Columns:")
print(df1.merge(df2, on=['A', 'B'], how='inner'))

# 6. Merge with suffixes for overlapping column names
print("\nMerge with Suffixes:")
print(df1.merge(df2, on='A', suffixes=('_left', '_right'), how='inner'))

# 7. Join DataFrames by index (default join type is left)
print("\nJoin by Index:")
print(df1.set_index('A').join(df2.set_index('A')))

# 8. Join on multiple indexes
print("\nJoin on Multiple Indexes:")
print(df1.set_index(['A', 'B']).join(df2.set_index(['A', 'B'])))

# 9. Concatenate two DataFrames along rows (vertical concatenation)
print("\nConcatenate Vertically:")
print(pd.concat([df1, df2], axis=0))

# 10. Concatenate two DataFrames along columns (horizontal concatenation)
print("\nConcatenate Horizontally:")
print(pd.concat([df1, df2], axis=1))

# 11. Concatenate DataFrames with different columns
print("\nConcatenate with Different Columns:")
print(pd.concat([df1, df2], axis=0, ignore_index=True))

# 12. Concatenate with keys (for hierarchical indexing)
print("\nConcatenate with Keys:")
print(pd.concat([df1, df2], axis=0, keys=['df1', 'df2']))

In [61]:
df.head()

         Age   Salary             Role
Name
Nikhil    22  1200000      AI Engineer
Sandeep   24  1200000   Data Scientist
Potti     48  2400000  MLOPS Developer

# WINDOW FUNCTION

In [74]:
df["Rolling_Avg"] = df['Salary'].rolling(window=2).mean()
print(df)
print("-" * 65)
df["Rolling_Sum"] = df["Salary"].rolling(window=2).sum()
print(df)
print("-" * 65)
df["Expanding_Sum"] = df['Salary'].rolling(window=2).sum()
print(df)
print("-"*65)
df["Exponentially_Weighted_Moving_Average"] = df['Salary'].ewm(span=2).mean()
print(df)

         Age   Salary             Role  Rolling_Avg  Rolling_Sum  Expanding_Sum
Name
Nikhil    22  1200000      AI Engineer          NaN          NaN            NaN
Sandeep   24  1200000   Data Scientist   1200000.00   2400000.00     2400000.00
Potti     48  2400000  MLOPS Developer   1800000.00   3600000.00     3600000.00
-----------------------------------------------------------------
         Age   Salary             Role  Rolling_Avg  Rolling_Sum  Expanding_Sum
Name
Nikhil    22  1200000      AI Engineer          NaN          NaN            NaN
Sandeep   24  1200000   Data Scientist   1200000.00   2400000.00     2400000.00
Potti     48  2400000  MLOPS Developer   1800000.00   3600000.00     3600000.00
-----------------------------------------------------------------
         Age   Salary             Role  Rolling_Avg  Rolling_Sum  Expanding_Sum
Name
Nikhil    22  1200000      AI Engineer          NaN          NaN            NaN
Sandeep   24  1200000   Data Scientist   1200000.00   2400000.00     2400000.00
Potti     48  2400000  MLOPS Developer   1800000.00   3600000.00     3600000.00
-----------------------------------------------------------------
         Age   Salary             Role  Rolling_Avg  Rolling_Sum  Expanding_Sum  Exponentially_Weighted_Moving_Average
Name
Nikhil    22  1200000      AI Engineer          NaN          NaN            NaN                             1200000.00
Sandeep   24  1200000   Data Scientist   1200000.00   2400000.00     2400000.00                             1200000.00
Potti     48  2400000  MLOPS Developer   1800000.00   3600000.00     3600000.00                             2030769.23

<div style="background-color: #FFFFE0; padding: 10px; border: 1px solid #ddd;">
  <p style="color: #333333;"><b>Concat DFs</b></p>
</div>

In [77]:
df1 = pd.DataFrame({
    'A': [1, 2, 3],
    'B': ['a', 'b', 'c'],
    'C': [10, 20, 30]
})

df2 = pd.DataFrame({
    'A': [4, 5, 6],
    'B': ['d', 'e', 'f'],
    'D': [40, 50, 60]
})

In [82]:
# 1. along rows (axis=0)
df_new = pd.concat([df1, df2], axis=0)

# 2. along columns (axis=1)
df_new = pd.concat([df1,df2], axis=1)

# 3. Ignore index
df_new = pd.concat([df1,df2], axis=0, ignore_index=True)

# 4. Concat keys for heirarchial indexing
df_new = pd.concat([df1,df2], axis=0, keys=['df1','df2'])

# 5. Concatenate DataFrames with different columns
df_new = pd.concat([df1, df2], axis=1, join='outer')

In [83]:
df_new

   A  B   C  A  B   D
0  1  a  10  4  d  40
1  2  b  20  5  e  50
2  3  c  30  6  f  60

<div style="background-color: #FFFFE0; padding: 10px; border: 1px solid #ddd;">
  <p style="color: #333333;"><b>Aggregate & group by</b></p>
</div>

In [88]:
df = pd.DataFrame({
    'Store': ['A', 'A', 'B', 'B', 'C', 'C', 'C'],
    'Product': ['Apple', 'Banana', 'Apple', 'Banana', 'Apple', 'Banana', 'Apple'],
    'Sales': [100, 150, 200, 250, 300, 350, 400],
    'Quantity': [10, 15, 20, 25, 30, 35, 40]
})

In [89]:
# 1. Single Column
df_grouped = df.groupby('Store')[['Sales','Quantity']].sum()
df_grouped

       Sales  Quantity
Store
A        250        25
B        450        45
C       1050       105

In [91]:
# 2. multiple Cols

df_grouped = df.groupby(["Store", "Product"])[["Sales", "Quantity"]].sum()
df_grouped

               Sales  Quantity
Store Product
A     Apple      100        10
      Banana     150        15
B     Apple      200        20
      Banana     250        25
C     Apple      700        70
      Banana     350        35

In [92]:
# 3. Custom Function

df_grouped_custom = df.groupby('Store')['Sales'].apply(lambda x: x.max() - x.min())
df_grouped_custom

Store
A     50
B     50
C    100
Name: Sales, dtype: int64

In [93]:
# 4. Custom Aggregation

df_agg = df.groupby('Store').agg({
    'Sales': ['mean', 'sum', 'count'],
    'Quantity': 'sum'
})

df_agg

       Sales             Quantity
        mean   sum count      sum
Store
A     125.00   250     2       25
B     225.00   450     2       45
C     350.00  1050     3      105

In [94]:
# 5. Specific

df_agg_cols = df.groupby('Store').agg(
    Sales_Sum = ('Sales','sum'),
    Quantity_avg=('Quantity','mean')
)

df_agg_cols

       Sales_Sum  Quantity_avg
Store
A            250         12.50
B            450         22.50
C           1050         35.00

In [95]:
# 6. first & last value

df_first_last = df.groupby('Store').agg({
    'Sales': 'first',  # Get the first 'Sales' value
    'Quantity': 'last'  # Get the last 'Quantity' value
})

print(df_first_last)

       Sales  Quantity
Store
A        100        15
B        200        25
C        300        40

In [96]:
# 7. Reset the index after a groupby operation
df_grouped_reset = df.groupby('Store').agg({
    'Sales': 'sum',
    'Quantity': 'sum'
}).reset_index()

print(df_grouped_reset)

  Store  Sales  Quantity
0     A    250        25
1     B    450        45
2     C   1050       105

# NLargest

In [97]:
df = pd.DataFrame({
    'Store': ['A', 'B', 'C', 'A', 'B', 'C'],
    'Sales': [100, 200, 300, 150, 250, 350],
    'Quantity': [10, 20, 30, 15, 25, 35]
})

# Get the top 2 rows based on 'Sales'
df_top2_sales = df.nlargest(2, 'Sales')

print(df_top2_sales)

  Store  Sales  Quantity
5     C    350        35
2     C    300        30

In [98]:
# Sort by 'Sales' in descending order and then by 'Quantity' in ascending order
df_sorted_multi = df.sort_values(by=['Sales', 'Quantity'], ascending=[False, True])

print(df_sorted_multi)

  Store  Sales  Quantity
5     C    350        35
2     C    300        30
4     B    250        25
1     B    200        20
3     A    150        15
0     A    100        10

In [99]:
# DataFrame with duplicate rows
df_dup = pd.DataFrame({
    'Store': ['A', 'B', 'C', 'A', 'B', 'C'],
    'Sales': [100, 200, 300, 100, 200, 300],
    'Quantity': [10, 20, 30, 10, 20, 30]
})

# Remove duplicates based on 'Store' and 'Sales'
df_no_dup = df_dup.drop_duplicates(subset=['Store', 'Sales'])

print(df_no_dup)

  Store  Sales  Quantity
0     A    100        10
1     B    200        20
2     C    300        30

In [100]:
# Use query to filter where 'Sales' is greater than 150
df_query = df.query('Sales > 150')

print(df_query)

  Store  Sales  Quantity
1     B    200        20
2     C    300        30
4     B    250        25
5     C    350        35

In [103]:
# Pivot table with 'Store' as rows, 'Product' as columns, and aggregate sales by sum
df_pivot_table = df.pivot_table(index='Store', columns='Quantity', values='Sales', aggfunc='sum')

print(df_pivot_table)

Quantity     10     15     20     25     30     35
Store
A        100.00 150.00    NaN    NaN    NaN    NaN
B           NaN    NaN 200.00 250.00    NaN    NaN
C           NaN    NaN    NaN    NaN 300.00 350.00

# ML

In [140]:
import numpy as np
import pandas as pd
from sklearn.compose import ColumnTransformer 
from sklearn.preprocessing import StandardScaler, OneHotEncoder
from sklearn.pipeline import Pipeline
from sklearn.model_selection import train_test_split
from sklearn.linear_model import LinearRegression
from sklearn.metrics import mean_squared_error, r2_score, mean_absolute_error
from sklearn.model_selection import GridSearchCV

# Example data generation
np.random.seed(42)

# Create a synthetic dataset
n_samples = 500
X1 = np.random.randn(n_samples)  # Feature 1
X2 = np.random.rand(n_samples) * 100  # Feature 2
categories = ['A', 'B', 'C']
cat_feature = np.random.choice(categories, size=n_samples)
y = 2 * X1 + 3 * X2 + np.random.randn(n_samples) * 10  # Target variable

# Create the DataFrame
df = pd.DataFrame({
    'X1': X1,
    'X2': X2,
    'Category': cat_feature,
    'Target': y
})

# Select numerical columns
numerical_cols = df[['X1', 'X2', 'Target']].columns
print("Numerical Columns:", numerical_cols)

# Select categorical columns
categorical_columns = ['Category']
print("Categorical Columns:", categorical_columns)

# Create preprocessor using ColumnTransformer
preprocessor = ColumnTransformer(
    transformers=[
        ('num', StandardScaler(), numerical_cols[:-1]),  # Scale numerical features X1 and X2 (exclude Target)
        ('cat', OneHotEncoder(drop='first'), categorical_columns)  # One-hot encode categorical 'Category'
    ]
)

# Create pipeline with preprocessor and Linear Regression model
pipeline = Pipeline(
    steps=[
        ('preprocessor', preprocessor),
        ('model', LinearRegression())
    ]
)

# Split data into training and testing sets
X = df.drop(columns=["Target"])  # Features (drop target)
y = df["Target"]  # Target variable
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.2, random_state=42)

# Define hyperparameter tuning space for the linear model
param_grid = {
    'model__fit_intercept': [True, False]  # Grid search for model's fit_intercept parameter
}

# Perform hyperparameter tuning using GridSearchCV
grid_search = GridSearchCV(pipeline, param_grid, cv=5)
grid_search.fit(X_train, y_train)

# Get the best-performing model from grid search
best_model = grid_search.best_estimator_

# Make predictions on the test set
y_pred = best_model.predict(X_test)

# Evaluate model performance using MSE, R2, and MAE
mse = mean_squared_error(y_test, y_pred)
r2 = r2_score(y_test, y_pred)
mae = mean_absolute_error(y_test, y_pred)

# Print the evaluation metrics
print(f"Mean Squared Error (MSE): {mse}")
print(f"R-squared (R²): {r2}")
print(f"Mean Absolute Error (MAE): {mae}")

Numerical Columns: Index(['X1', 'X2', 'Target'], dtype='object')
Categorical Columns: ['Category']
Mean Squared Error (MSE): 112.35212427247545
R-squared (R²): 0.9855696762651559
Mean Absolute Error (MAE): 8.514072634593639